01 - Курсовые проекты/2023-2024 - Разр. механизма вывода типов для компилятора языка Kodept/src/mermaid/arch.mmd
flowchart LR
    A[Frontend]
    B[Middle-end]
    C[Backend]

    S{{Исходный код}}
    E{{Исполняемый файл}}

    A --> B --> C

    S --> A
    C --> E
