04 - ВКРы/2023-2024 - Тема в разработке/src/plantuml/arch.puml
@startuml
'https://plantuml.com/activity-diagram-beta

:Исходный код<

:Frontend;

:Middle-end;

:Backend;

:Исполняемый файл>

@enduml
